# Pandas Praktise

In [3]:
import pandas as pd
import numpy as np
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s, s.shape, type(s)

(0    1.0
 1    3.0
 2    5.0
 3    NaN
 4    6.0
 5    8.0
 dtype: float64,
 (6,),
 pandas.core.series.Series)

In [6]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABDE'))
df

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885
2013-01-06 -0.060342 -0.799923  0.378744 -0.142697

In [10]:
df2 = pd.DataFrame(
    {
    'A':1.0,
    'B':pd.Timestamp('20130101'),
    'C':pd.Series(1, index=list(range(4)), dtype='float32'),
    'D':np.array([3]*4, dtype='int32'),
    'E':pd.Categorical(['test', 'train', 'test', 'train']),
    'F':'Foo',
    })
df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  Foo
1  1.0 2013-01-01  1.0  3  train  Foo
2  1.0 2013-01-01  1.0  3   test  Foo
3  1.0 2013-01-01  1.0  3  train  Foo

In [11]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [13]:
df.head()

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885

In [14]:
df.head()

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885

In [15]:
df.tail(3)

                   A         B         D         E
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885
2013-01-06 -0.060342 -0.799923  0.378744 -0.142697

In [17]:
print(df.index)
df.columns

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'D', 'E'], dtype='object')

In [19]:
df.to_numpy()

array([[ 1.06714547,  0.84410473, -0.73382088,  0.29845643],
       [-0.08295104,  0.96001187, -0.67283038,  1.52708739],
       [ 0.35277725, -0.68243353, -1.09819277, -1.08142527],
       [-1.41695124,  0.16600058,  0.48172007, -0.10182421],
       [ 0.26347747,  1.0903467 , -1.4786634 ,  1.87488503],
       [-0.06034242, -0.79992292,  0.37874384, -0.14269733]])

In [20]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [22]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'test', 'Foo'],
       [1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'train', 'Foo'],
       [1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'test', 'Foo'],
       [1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'train', 'Foo']],
      dtype=object)

In [23]:
df.describe()

              A         B         D         E
count  6.000000  6.000000  6.000000  6.000000
mean   0.020526  0.263018 -0.520507  0.395747
std    0.818342  0.841554  0.791657  1.113264
min   -1.416951 -0.799923 -1.478663 -1.081425
25%   -0.077299 -0.470325 -1.007100 -0.132479
50%    0.101568  0.505053 -0.703326  0.098316
75%    0.330452  0.931035  0.115850  1.219930
max    1.067145  1.090347  0.481720  1.874885

In [24]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.067145   -0.082951    0.352777   -1.416951    0.263477   -0.060342
B    0.844105    0.960012   -0.682434    0.166001    1.090347   -0.799923
D   -0.733821   -0.672830   -1.098193    0.481720   -1.478663    0.378744
E    0.298456    1.527087   -1.081425   -0.101824    1.874885   -0.142697

In [25]:
df

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885
2013-01-06 -0.060342 -0.799923  0.378744 -0.142697

In [30]:
df.sort_index(axis=1)

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885
2013-01-06 -0.060342 -0.799923  0.378744 -0.142697

In [31]:
df.sort_values('B')

                   A         B         D         E
2013-01-06 -0.060342 -0.799923  0.378744 -0.142697
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-05  0.263477  1.090347 -1.478663  1.874885

In [32]:
df.A

2013-01-01    1.067145
2013-01-02   -0.082951
2013-01-03    0.352777
2013-01-04   -1.416951
2013-01-05    0.263477
2013-01-06   -0.060342
Freq: D, Name: A, dtype: float64

In [33]:
df[0:3]

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425

In [34]:
df["20130102":"20130104"]

                   A         B         D         E
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824

In [35]:
df

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885
2013-01-06 -0.060342 -0.799923  0.378744 -0.142697

In [36]:
df.loc[dates[0]]

A    1.067145
B    0.844105
D   -0.733821
E    0.298456
Name: 2013-01-01 00:00:00, dtype: float64

In [37]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.067145  0.844105
2013-01-02 -0.082951  0.960012
2013-01-03  0.352777 -0.682434
2013-01-04 -1.416951  0.166001
2013-01-05  0.263477  1.090347
2013-01-06 -0.060342 -0.799923

In [38]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.082951  0.960012
2013-01-03  0.352777 -0.682434
2013-01-04 -1.416951  0.166001

In [40]:
df.loc[dates[0], "A"]

1.067145468166137

In [41]:
df.at[dates[0], 'A']

1.067145468166137

In [42]:
df

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-02 -0.082951  0.960012 -0.672830  1.527087
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-04 -1.416951  0.166001  0.481720 -0.101824
2013-01-05  0.263477  1.090347 -1.478663  1.874885
2013-01-06 -0.060342 -0.799923  0.378744 -0.142697

In [43]:
df.iloc[3]

A   -1.416951
B    0.166001
D    0.481720
E   -0.101824
Name: 2013-01-04 00:00:00, dtype: float64

In [44]:
df.iloc[0]

A    1.067145
B    0.844105
D   -0.733821
E    0.298456
Name: 2013-01-01 00:00:00, dtype: float64

In [45]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.416951  0.166001
2013-01-05  0.263477  1.090347

In [48]:
df.iloc[5, 0]

-0.06034242368320361

In [51]:
df[df['A'] > 0]

                   A         B         D         E
2013-01-01  1.067145  0.844105 -0.733821  0.298456
2013-01-03  0.352777 -0.682434 -1.098193 -1.081425
2013-01-05  0.263477  1.090347 -1.478663  1.874885

In [52]:
df.A > 0

2013-01-01     True
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [54]:
df[df > 0]

                   A         B         D         E
2013-01-01  1.067145  0.844105       NaN  0.298456
2013-01-02       NaN  0.960012       NaN  1.527087
2013-01-03  0.352777       NaN       NaN       NaN
2013-01-04       NaN  0.166001  0.481720       NaN
2013-01-05  0.263477  1.090347       NaN  1.874885
2013-01-06       NaN       NaN  0.378744       NaN

In [59]:
df2 =  df.copy()
df2['E']=['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         D      E
2013-01-01  1.067145  0.844105 -0.733821    one
2013-01-02 -0.082951  0.960012 -0.672830    one
2013-01-03  0.352777 -0.682434 -1.098193    two
2013-01-04 -1.416951  0.166001  0.481720  three
2013-01-05  0.263477  1.090347 -1.478663   four
2013-01-06 -0.060342 -0.799923  0.378744  three

In [60]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         D     E
2013-01-03  0.352777 -0.682434 -1.098193   two
2013-01-05  0.263477  1.090347 -1.478663  four

In [61]:
s = pd.Series(np.random.randint(10, 100, 11))
s

0     19
1     72
2     86
3     24
4     44
5     71
6     36
7     90
8     14
9     14
10    67
dtype: int32

In [62]:
s.value_counts()

14    2
19    1
72    1
86    1
24    1
44    1
71    1
36    1
90    1
67    1
Name: count, dtype: int64